# 2.1 Виводжу вбудованні константи за допомогою команд:
print("Перша константа: ", True)
print("Друга константа: ", False)
print("Третя константа: ", NotImplemented)
print("-----------------------------------------------------")

# 2.2 Виводжу результат роботи вбудованих функцій за допомогою команд:
print("Число 20 в 16-ві системі числення дорівнює: ", hex(20))
print("2 в 10 степені дорівнює: ", pow(2,10))
print("Максимальне число з чисел 5,6,9,3,45 :",max(5,6,9,3,45))
print("-----------------------------------------------------")

# 2.3 Виводжу результат роботи циклу і розгалужень за допомогою команд:
x= [1 for i in range(10)]
print("Виведення 10 одиниць з масиву: ",x)

b=5
print("Змінна B дорівнює 5" if b == 5 else "Змінна B не дорівнює 5")
print("-----------------------------------------------------")

# 2.4 Виводжу результат роботи конструкції `try`->`except`->`finally` за допомогою команд:
y=[5,2]
print("Що буде якщо вивести 10 елемент масиву y[]?: ")
try:
    print(y[10])
except Exception as e:
    print(e)
finally:
    print("То ось що буде!")
print("-----------------------------------------------------")

# 2.5 Виводжу результат роботи контекст-менеджера `with` за допомогою команд:
i=1
with open("README.md", "r") as file:
    for line in file:
        print("Рядок " + str(i) + ": " + line)
        i=i+1
print("-----------------------------------------------------")

# 2.6 Виводжу результат роботи з `lambdas` за допомогою команд:
new_lambda = lambda first_number, second_number: f'Сума першого і другого числа дорівнює {first_number + second_number}'
print("Розташування функції в памяті: ", new_lambda)
print("Виклик лямбди: ", new_lambda(5, 6))
